       *> setup the identification division
       IDENTIFICATION DIVISION.
         *> setup the program id
         PROGRAM-ID. CONTAINMENTUNIT.
         *> setup the procedure division (equiv. main() function)
       PROCEDURE DIVISION.
         *> print welcome 
         DISPLAY 'COVID-2020 Containment Unit'.
         DISPLAY 'Danger Biohazard'.
       *> end program
       STOP RUN.
